Documents/ФактПоказателяЭффективностиСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ФактПоказателяЭффективностиСотрудников</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ФактическиеЗначенияПоказателейЭффективностиСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Горизонт</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураЦелей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Позиция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеПоказателяЭффективности</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ФактПоказателяЭффективностиСотрудников/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		ЗначенияДляЗаполнения = Новый Структура("Ответственный, Месяц", "Объект.Ответственный", "Объект.Период");
		ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтотОбъект, ЗначенияДляЗаполнения);
		
		ПриПолученииДанныхНаСервере();
	КонецЕсли;
	
	// Обработчик подсистемы "ВерсионированиеОбъектов".
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриПолученииДанныхНаСервере();
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	МассивСотрудников = Новый Массив;
	Для каждого СтрокаСотрудник Из Объект.Сотрудники  Цикл
		МассивСотрудников.Добавить(СтрокаСотрудник.Сотрудник);
	КонецЦикла;
	Оповестить("Запись_ФактПоказателяЭффективностиСотрудников", МассивСотрудников);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ПриПолученииДанныхНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	ПроверитьВозможностьОчисткиТабличнойЧасти(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказательПриИзменении(Элемент)
	
	ПроверитьВозможностьОчисткиТабличнойЧасти(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыПриИзмененииЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	ОчиститьСотрудников(ЭтотОбъект);
	СохранитьЗначенияРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	КлючевыеПоказателиЭффективностиКлиент.ПериодСтрокойРегулирование(ЭтотОбъект, Направление);
КонецПроцедуры

&НаКлиенте
Процедура ПериодСтрокойНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	КлючевыеПоказателиЭффективностиКлиент.ВыбратьПериод(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСотрудники

&НаКлиенте
Процедура СотрудникиСотрудникПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ДополнитьТаблицуРабочихМестСотрудниковНаСервере(ТекущиеДанные.Сотрудник);
	УстановитьПозициюСотрудника(ЭтотОбъект, ТекущиеДанные);
	ЗаполнитьОписаниеПериодаРаботыСотрудника(ЭтотОбъект, ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПозицияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьОписаниеПериодаРаботыСотрудника(ЭтотОбъект, ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиСотрудникНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Элемент.СписокВыбора.Очистить();
	Элемент.СписокВыбора.ЗагрузитьЗначения(СотрудникиПоПоказателю());
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПозицияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	
	СтрокиСотрудника = ТаблицаРабочихМест.НайтиСтроки(Новый Структура("Сотрудник", ТекущиеДанные.Сотрудник));
	Если СтрокиСотрудника.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	Элемент.СписокВыбора.Очистить();
	Для каждого ЭлементСотрудник Из СтрокиСотрудника Цикл
		Элемент.СписокВыбора.Добавить(ЭлементСотрудник.Позиция);
	КонецЦикла;
	
	Элемент.ВыбиратьТип = Ложь;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ЗаполнитьПоОтветственному(Команда)
	ЗаполнитьСписокСотрудниковПоОтветственномуНаСервере();
КонецПроцедуры

#Область ЗагрузкаДанныхИзФайла

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	ПараметрыЗагрузки = ЗагрузкаДанныхИзФайлаКлиент.ПараметрыЗагрузкиДанных();
	ПараметрыЗагрузки.ПолноеИмяТабличнойЧасти = "ФактПоказателяЭффективностиСотрудников.Сотрудники";
	ПараметрыЗагрузки.Заголовок = НСтр("ru = 'Загрузка фактических значений показателя сотрудников из файла'");
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Подразделение", Объект.Подразделение);
	
	ПараметрыЗагрузки.ДополнительныеПараметры = ДополнительныеПараметры;
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьСотрудниковИзФайлаЗавершение", ЭтотОбъект);
	ЗагрузкаДанныхИзФайлаКлиент.ПоказатьФормуЗагрузки(ПараметрыЗагрузки, Оповещение);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиентеНаСервереБезКонтекста
Процедура ОчиститьСотрудников(Форма)

	Форма.Объект.Сотрудники.Очистить();

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВозможностьОчисткиТабличнойЧасти(ИзменяемыйРеквизит)

	Оповещение = Новый ОписаниеОповещения("РеквизитыПриИзмененииЗавершение", ЭтотОбъект);
	КлючевыеПоказателиЭффективностиКлиент.ПроверитьВозможностьОчисткиТабличнойЧасти(
		Объект,
		"Сотрудники",
		Тип("ДокументСсылка.ФактПоказателяЭффективностиСотрудников"),
		ИзменяемыйРеквизит,
		СохраненныеЗначенияРеквизитов,
		Оповещение);

КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#Область ЗагрузкаДанныхИзФайла

&НаКлиенте
Процедура ЗагрузитьСотрудниковИзФайлаЗавершение(АдресЗагруженныхДанных, ДополнительныеПараметры) Экспорт
	
	Если АдресЗагруженныхДанных = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ЗагрузитьСотрудниковИзФайлаНаСервере(АдресЗагруженныхДанных);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСотрудниковИзФайлаНаСервере(АдресЗагруженныхДанных)
	
	ДобавленыСтроки = Ложь;
	
	ЗагруженныеДанные = ПолучитьИзВременногоХранилища(АдресЗагруженныхДанных);
	Для Каждого СтрокаДанных Из ЗагруженныеДанные Цикл 
		
		Если Не ЗначениеЗаполнено(СтрокаДанных.Сотрудник) Тогда 
			Продолжить;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(Объект.Сотрудники.Добавить(), СтрокаДанных);
		
		ДобавленыСтроки = Истина;
	КонецЦикла;
	
	Модифицированность = Модифицированность ИЛИ ДобавленыСтроки;
	
	Если Не ДобавленыСтроки Тогда
		Возврат;
	КонецЕсли;
	
	КлючевыеПоказателиЭффективностиФормы.ЗаполнитьТаблицуРабочихМестСотрудников(
		ТаблицаРабочихМест,
		Объект.Сотрудники.Выгрузить(),
		СтруктураРеквизитовДокумента());
	
	Для Каждого СтрокаСотрудники Из Объект.Сотрудники Цикл 
		Если ЗначениеЗаполнено(СтрокаСотрудники.Позиция) Тогда 
			Продолжить;
		КонецЕсли;
		УстановитьПозициюСотрудника(ЭтотОбъект, СтрокаСотрудники);
		ЗаполнитьОписаниеПериодаРаботыСотрудника(ЭтотОбъект, СтрокаСотрудники);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ПриПолученииДанныхНаСервере()

	ЗаполнитьВторичныеРеквизитыФормы();
	СохранитьЗначенияРеквизитов(ЭтотОбъект);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СохранитьЗначенияРеквизитов(Форма)
	
	НовыеЗначения = Новый Структура;
	НовыеЗначения.Вставить("Показатель", Форма.Объект.Показатель);
	НовыеЗначения.Вставить("Подразделение", Форма.Объект.Подразделение);
	
	Форма.СохраненныеЗначенияРеквизитов = Новый ФиксированнаяСтруктура(НовыеЗначения);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВторичныеРеквизитыФормы()
	
	КлючевыеПоказателиЭффективностиКлиентСервер.УстановитьПредставлениеПериодаПоДате(ЭтотОбъект);
	
	КлючевыеПоказателиЭффективностиФормы.ЗаполнитьТаблицуРабочихМестСотрудников(
		ТаблицаРабочихМест,
		Объект.Сотрудники.Выгрузить(),
		СтруктураРеквизитовДокумента());
	
	ЗаполнитьВторичныеРеквизитыТаблицыСотрудники();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВторичныеРеквизитыТаблицыСотрудники()

	Для каждого СтрокаСотрудники Из Объект.Сотрудники Цикл
		ЗаполнитьОписаниеПериодаРаботыСотрудника(ЭтотОбъект, СтрокаСотрудники);
	КонецЦикла;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьОписаниеПериодаРаботыСотрудника(Форма, СтрокаСотрудника)

	МестаРаботыСотрудника = Форма.ТаблицаРабочихМест.НайтиСтроки(Новый Структура("Сотрудник", СтрокаСотрудника.Сотрудник));
	
	СтрокаСотрудника.КоличествоПериодовРаботы = МестаРаботыСотрудника.Количество();
	СтрокаСотрудника.ПозицииНетВТаблицеРабочихМест = Истина;
	
	Если МестаРаботыСотрудника.Количество() = 0 Тогда
		СтрокаПериода = НСтр("ru = '<нет периодов работы>'");
	Иначе
		МассивСтрок = Новый Массив;
		Для каждого МестоРаботы Из МестаРаботыСотрудника Цикл
			Если МестоРаботы.Позиция = СтрокаСотрудника.Позиция Тогда
				ТекстПериода = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
								"%1 - %2",
								Формат(МестоРаботы.ДатаНачала,"ДЛФ=D"),
								Формат(МестоРаботы.ДатаОкончания,"ДЛФ=D"));
				МассивСтрок.Добавить(ТекстПериода);
				
				СтрокаСотрудника.ПозицииНетВТаблицеРабочихМест = Ложь;
			КонецЕсли;
		КонецЦикла;
		
		Если СтрокаСотрудника.КоличествоПериодовРаботы > 1 Тогда
			СтрокаПериода = СтрСоединить(МассивСтрок, ", ");
		КонецЕсли;
		
	КонецЕсли;
	
	ОписаниеПериодаРаботы = Строка(СтрокаСотрудника.Позиция);
	Если ЗначениеЗаполнено(СтрокаПериода) Тогда
		ОписаниеПериодаРаботы = ОписаниеПериодаРаботы + " (" + СтрокаПериода + ")";
	КонецЕсли;
	
	СтрокаСотрудника.ОписаниеПериодаРаботы = ОписаниеПериодаРаботы;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокСотрудниковПоОтветственномуНаСервере()

	ЗаполнитьСотрудников();
	
	ЗаполнитьВторичныеРеквизитыТаблицыСотрудники();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСотрудников()

	УдалитьВТ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	// Получаем список позиций, на которые назначен этот показатель.
	КоллекцияОтборов = КоллекцияОтборов(,Истина);
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(
		КоллекцияОтборов, "ОтветственныйЗаВводФакта", "=", Объект.Ответственный);
		
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Показатель КАК Показатель
	|ПОМЕСТИТЬ ВТФильтрИзмерений";
	
	Запрос.УстановитьПараметр("Период", Объект.Период);
	Запрос.УстановитьПараметр("Показатель", Объект.Показатель);
	
	Запрос.Выполнить();
	УдалитьВТ.Добавить("ВТФильтрИзмерений");
	
	КлючевыеПоказателиЭффективности.СоздатьВТСотрудникиВводаЗначенийПоказателей(
		Запрос.МенеджерВременныхТаблиц,
		"ВТФильтрИзмерений",
		"Показатель",
		КоллекцияОтборов);
	УдалитьВТ.Добавить("ВТСотрудникиВводаЗначенийПоказателей");
	
	СтруктураДат = КлючевыеПоказателиЭффективностиКлиентСервер.ДатыПериодаГоризонта(Объект.Период, Объект.Горизонт);
	
	Запрос.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц; 
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&НачалоПериода КАК НачалоПериода,
	|	&ОкончаниеПериода КАК ОкончаниеПериода,
	|	Сотрудники.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТСотрудники
	|ИЗ
	|	ВТСотрудникиВводаЗначенийПоказателей КАК Сотрудники";
	Запрос.УстановитьПараметр("НачалоПериода", СтруктураДат.ДатаНачала);
	Запрос.УстановитьПараметр("ОкончаниеПериода", СтруктураДат.ДатаОкончания);
	Запрос.Выполнить();
	
	ПараметрыПоВременнойТаблице = КадровыйУчет.ПараметрыДляЗапросВТРабочиеМестаСотрудниковПоВременнойТаблице(
		"ВТСотрудники", "Сотрудник", "НачалоПериода", "ОкончаниеПериода");
	ПараметрыПоВременнойТаблице.РаботникиПоДоговорамГПХ = Истина;
	ПараметрыПоВременнойТаблице.РаботникиПоТрудовымДоговорам = Истина; 
	
	Источник = ПодразделениеОрганизации(Объект.Подразделение);
		
	Если ТипЗнч(Источник) = Тип("СправочникСсылка.Организации") Тогда
		ПараметрыПоВременнойТаблице.Организация = Источник;
	ИначеЕсли ТипЗнч(Источник) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
		ПараметрыПоВременнойТаблице.Подразделение = Источник;
	КонецЕсли;

	УдалитьВТ.Добавить("ВТСотрудники");
	КадровыйУчет.СоздатьВТРабочиеМестаСотрудниковПоВременнойТаблице(Запрос.МенеджерВременныхТаблиц, Ложь,
		ПараметрыПоВременнойТаблице, "ВТРабочиеМестаПоСотрудникам");
	
	УдалитьВТ.Добавить("ВТРабочиеМестаПоСотрудникам");
	КоллекцияОтборов = КоллекцияОтборов( , , СтруктураДат.ДатаОкончания);
	КлючевыеПоказателиЭффективности.СоздатьВТПозицииВводаЗначенийПоказателей(
		Запрос.МенеджерВременныхТаблиц,
		"ВТФильтрИзмерений",
		"Показатель",
		КоллекцияОтборов);
		
	УдалитьВТ.Добавить("ВТПозицииВводаЗначенийПоказателей");
	
	КоллекцияОтборов = КоллекцияОтборов(Истина);
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(
		КоллекцияОтборов, "ОтветственныйЗаВводФакта", "=", Объект.Ответственный);

	КлючевыеПоказателиЭффективности.СоздатьВТПодразделенияВводаЗначенийПоказателей(
		Запрос.МенеджерВременныхТаблиц,
		"ВТФильтрИзмерений",
		"Показатель",
		КоллекцияОтборов);
		
	УдалитьВТ.Добавить("ВТПодразделенияВводаЗначенийПоказателей");
	
	ОрганизационнаяСтруктура.СоздатьВТПозицииПодразделений(Запрос.МенеджерВременныхТаблиц, "ВТПодразделенияВводаЗначенийПоказателей");
	УдалитьВТ.Добавить("ВТПозицииПодразделений");
	
	// Объединяем списки позиций.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПозицииВводаЗначенийПоказателей.Позиция КАК Позиция
	|ПОМЕСТИТЬ ВТПозицииОтбор
	|ИЗ
	|	ВТПозицииВводаЗначенийПоказателей КАК ПозицииВводаЗначенийПоказателей
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ПозицииПодразделений.Позиция
	|ИЗ
	|	ВТПозицииПодразделений КАК ПозицииПодразделений";
	
	Запрос.Выполнить();
	УдалитьВТ.Добавить("ВТПозицииОтбор");
	
	// Получаем список сотрудников, когда-либо работавших на этих позициях в периоде.
	КлючевыеПоказателиЭффективности.СоздатьВТПериодыРаботыСотрудниковПоСпискуПозиций(Запрос.МенеджерВременныхТаблиц, "ВТПозицииОтбор", СтруктураРеквизитовДокумента());
	УдалитьВТ.Добавить("ВТПериодыРаботыСотрудников");
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТПериодыРаботыСотрудников.Сотрудник КАК Сотрудник,
	|	ВТПериодыРаботыСотрудников.Позиция КАК Позиция,
	|	МИНИМУМ(ВТПериодыРаботыСотрудников.ДатаНачала) КАК ДатаНачала
	|ПОМЕСТИТЬ УказателиСотрудников
	|ИЗ
	|	ВТПериодыРаботыСотрудников КАК ВТПериодыРаботыСотрудников
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТПериодыРаботыСотрудников.Сотрудник,
	|	ВТПериодыРаботыСотрудников.Позиция
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТПериодыРаботыСотрудников.Сотрудник КАК Сотрудник,
	|	ВТПериодыРаботыСотрудников.Позиция КАК Позиция
	|ИЗ
	|	ВТПериодыРаботыСотрудников КАК ВТПериодыРаботыСотрудников
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ УказателиСотрудников КАК УказателиСотрудников
	|		ПО ВТПериодыРаботыСотрудников.Сотрудник = УказателиСотрудников.Сотрудник
	|			И ВТПериодыРаботыСотрудников.Позиция = УказателиСотрудников.Позиция
	|			И ВТПериодыРаботыСотрудников.ДатаНачала = УказателиСотрудников.ДатаНачала
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТПериодыРаботыСотрудников.Сотрудник КАК Сотрудник,
	|	ВТПериодыРаботыСотрудников.Позиция КАК Позиция,
	|	ВТПериодыРаботыСотрудников.ДатаНачала КАК ДатаНачала,
	|	ВТПериодыРаботыСотрудников.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	ВТПериодыРаботыСотрудников КАК ВТПериодыРаботыСотрудников
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРабочиеМестаПоСотрудникам.Сотрудник КАК Сотрудник,
	|	ВТРабочиеМестаПоСотрудникам.Период КАК ДатаНачала,
	|	ВТРабочиеМестаПоСотрудникам.ДолжностьПоШтатномуРасписанию КАК Позиция,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОкончания
	|ИЗ
	|	ВТРабочиеМестаПоСотрудникам КАК ВТРабочиеМестаПоСотрудникам";
	
	УдалитьВТ.Добавить("УказателиСотрудников");
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	Объект.Сотрудники.Загрузить(РезультатыЗапроса[РезультатыЗапроса.Количество() - 3].Выгрузить());
	ТаблицаРабочихМест.Загрузить(РезультатыЗапроса[РезультатыЗапроса.Количество() - 2].Выгрузить());
	
	РабочиеМеста = РезультатыЗапроса[РезультатыЗапроса.Количество() - 1].Выгрузить();

	Для Сч = 1 По РабочиеМеста.Количество() Цикл
		Если Сч < РабочиеМеста.Количество() И РабочиеМеста[Сч-1].Сотрудник = РабочиеМеста[Сч].Сотрудник Тогда
			РабочиеМеста[Сч-1].ДатаОкончания = РабочиеМеста[Сч].ДатаНачала - 86400;
		Иначе
			РабочиеМеста[Сч-1].ДатаОкончания = СтруктураДат.ДатаОкончания;
		КонецЕсли;
		НайденнаяСтрока = Объект.Сотрудники.НайтиСтроки(Новый Структура("Сотрудник,Позиция", РабочиеМеста[Сч-1].Сотрудник, РабочиеМеста[Сч-1].Позиция));
		Если НайденнаяСтрока.Количество() = 0 Тогда
			НоваяСтрока = ТаблицаРабочихМест.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, РабочиеМеста[Сч-1]);
			НоваяСтрока = Объект.Сотрудники.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, РабочиеМеста[Сч-1]);
		КонецЕсли;
	КонецЦикла;
	
	ЗарплатаКадры.УничтожитьВТ(Запрос.МенеджерВременныхТаблиц, УдалитьВТ);
	
КонецПроцедуры

&НаСервере
Функция КоллекцияОтборов(ПоПодразделению = Ложь, ПоСотруднику = Ложь, ДатаПолученияДанных = '00010101')
	
	КоллекцияОтборов = Новый Массив;
	
	Если Не ПоСотруднику Тогда
		ПодчиненныеПодразделения = ОрганизационнаяСтруктура.ПодчиненныеПодразделения(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Подразделение));
		
		Если ПоПодразделению Тогда
			Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
				ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(
				КоллекцияОтборов, "Подразделение", "В", ПодчиненныеПодразделения);
			КонецЕсли;
		Иначе
			ПозицииПодразделения = ОрганизационнаяСтруктура.ПозицииПодразделений(ПодчиненныеПодразделения,
				ДатаПолученияДанных).ВыгрузитьКолонку("Позиция");
			ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(
			КоллекцияОтборов, "Позиция", "В", ПозицииПодразделения);
		КонецЕсли;
	Иначе
		ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(
			КоллекцияОтборов, "Горизонт", "В", Объект.Горизонт);
	КонецЕсли;
	
	Возврат КоллекцияОтборов;
	
КонецФункции

&НаСервере
Функция СтруктураРеквизитовДокумента()
	
	СтруктураРеквизитов = Новый Структура;
	
	СтруктураРеквизитов.Вставить("Период", Объект.Период);
	СтруктураРеквизитов.Вставить("Горизонт", Объект.Горизонт);
	
	Возврат СтруктураРеквизитов;
	
КонецФункции

&НаСервере
Процедура ДополнитьТаблицуРабочихМестСотрудниковНаСервере(Сотрудник)

	КлючевыеПоказателиЭффективностиФормы.ДополнитьТаблицуРабочихМестСотрудников(
		ТаблицаРабочихМест,
		Сотрудник,
		СтруктураРеквизитовДокумента());

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПозициюСотрудника(Форма, ТекущиеДанные)

	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СтрокиСотрудника = Форма.ТаблицаРабочихМест.НайтиСтроки(Новый Структура("Сотрудник", ТекущиеДанные.Сотрудник));
	Если СтрокиСотрудника.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.Позиция = СтрокиСотрудника[0].Позиция;

КонецПроцедуры

&НаСервере
Функция СотрудникиПоПоказателю()
	
	МассивПозиций = КлючевыеПоказателиЭффективности.ТаблицаПозицийПоПоказателю(Объект.Период, Объект.Показатель).ВыгрузитьКолонку("Позиция");
	СтруктураДат = КлючевыеПоказателиЭффективностиКлиентСервер.ДатыПериодаГоризонта(Объект.Период, Объект.Горизонт);
	
	ПараметрыПолученияСотрудников = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолученияСотрудников.НачалоПериода = СтруктураДат.ДатаНачала;
	ПараметрыПолученияСотрудников.ОкончаниеПериода = СтруктураДат.ДатаОкончания;
		
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(
		ПараметрыПолученияСотрудников.Отборы, "ДолжностьПоШтатномуРасписанию", "В", МассивПозиций);
		
	Источник = ПодразделениеОрганизации(Объект.Подразделение);
		
	Если ТипЗнч(Источник) = Тип("СправочникСсылка.Организации") Тогда
		ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(
			ПараметрыПолученияСотрудников.Отборы, "Организация", "=", Источник);
	ИначеЕсли ТипЗнч(Источник) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
		ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(
			ПараметрыПолученияСотрудников.Отборы, "Подразделение", "В ИЕРАРХИИ", Источник);
	КонецЕсли;
	
	МассивСотрудниковПоПозициям = КадровыйУчет.СотрудникиОрганизации(Истина, ПараметрыПолученияСотрудников).ВыгрузитьКолонку("Сотрудник");
	
	КоллекцияОтборов = КоллекцияОтборов(,Истина);
	ТаблицаСотрудников = КлючевыеПоказателиЭффективности.ТаблицаСотрудниковПоПоказателю(
		Объект.Период, Объект.Показатель, Источник,КоллекцияОтборов);
	МассивСотрудников = ТаблицаСотрудников.ВыгрузитьКолонку("Сотрудник");
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивСотрудников, МассивСотрудниковПоПозициям);
	МассивСотрудников = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивСотрудников);
	
	Возврат МассивСотрудников;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПодразделениеОрганизации(Подразделение)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Подразделение, "Источник");
	
КонецФункции

#КонецОбласти
